In [1]:
# Importando o pandas
import pandas as pd

In [10]:
# Abrindo arquivo Excel
df = pd.read_excel("houses_to_rent_excel.xlsx", sep=';')
df.head(20)

   ,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa,rent amount,property tax,fire insurance,total
0   0,1,240,3,3,4,-,acept,furnished,R$0,"R$8,000",...
1   1,0,64,2,1,1,10,acept,not furnished,R$540,R$82...
2   2,1,443,5,5,4,3,acept,furnished,"R$4,172","R$7...
3   3,1,73,2,2,1,12,acept,not furnished,R$700,"R$1...
4   4,1,19,1,1,0,-,not acept,not furnished,R$0,"R$...
5   5,1,13,1,1,0,2,acept,not furnished,R$0,"R$2,20...
6   6,1,55,1,1,1,2,acept,furnished,"R$1,950","R$5,...
7   7,1,55,2,2,1,2,acept,not furnished,R$600,"R$1,...
8   8,1,82,3,1,1,3,acept,furnished,R$828,"R$2,000"...
9   9,1,32,1,1,1,16,acept,not furnished,R$533,"R$2...
10  10,0,60,1,1,0,6,acept,not furnished,R$480,R$72...
11  11,0,64,1,2,1,4,acept,furnished,R$406,"R$1,550...
12  12,1,20,1,1,0,4,acept,furnished,R$602,"R$1,800...
13  13,1,375,4,5,5,1,acept,not furnished,"R$4,793"...
14  14,1,92,2,1,1,7,not acept,furnished,R$690,"R$3...
15  15,0,56,2,1,1,1,acept,not furnished,R$345,R$95...
16  16,0,188,2,3,8,-,acept,not furnished,R$0,"R$3,...
17  17,1,100,3,2,1,-,acept,not furnished,R$0,"R$3,...
18  18,1,192,3,3,2,13,acept,not furnished,"R$2,100...
19  19,1,93,3,2,1,10,acept,not furnished,"R$1,497"...

In [12]:
# Especificando qual aba do arquivo abrir
df = pd.read_excel("houses_to_rent_excel.xlsx", sheet_name=1)
df.head(20)

            NOME  IDADE      CEP ESTADO
0  Henrique Lima     29  3318089     SP
1           Luiz     39   339283     RJ

In [14]:
# Verificando os nomes das abas com sheet_names
arquivo_excel = pd.ExcelFile("houses_to_rent_excel.xlsx")

In [15]:
arquivo_excel.sheet_names

['houses_to_rent', 'Planilha1']

In [17]:
# Usando Parse para selecionar as abas
aba1 = arquivo_excel.parse("Planilha1")
aba2 = arquivo_excel.parse("houses_to_rent")
aba1.head()

            NOME  IDADE      CEP ESTADO
0  Henrique Lima     29  3318089     SP
1           Luiz     39   339283     RJ

In [18]:
aba2.head()

  ,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa,rent amount,property tax,fire insurance,total
0  0,1,240,3,3,4,-,acept,furnished,R$0,"R$8,000",...
1  1,0,64,2,1,1,10,acept,not furnished,R$540,R$82...
2  2,1,443,5,5,4,3,acept,furnished,"R$4,172","R$7...
3  3,1,73,2,2,1,12,acept,not furnished,R$700,"R$1...
4  4,1,19,1,1,0,-,not acept,not furnished,R$0,"R$...